{
  "common": {
    "read-more": "Читать полностью",
    "contacts": "Контакты",
    "pages": "Страницы",
    "source": "Посмотреть источник"
  },
  "home": {
    "title": "На главную",
    "hero-section": {
      "header": "Коллекция чартов и визуализаций",
      "first-subheader": "Познакомьтесь с dataviz: небольшой коллекцией диаграмм, сделанных для сравнения разнообразных данных.",
      "second-subheader": "Каждая диаграмма на этом веб-сайте была создана с помощью D3.js, популярной библиотеки JavaScript для создания динамических интерактивных визуализаций данных в веб-браузерах.",
      "quote": "Величайшая ценность изображения - это когда она заставляет нас заметить то, чего мы никогда не ожидали увидеть.",
      "quote-author": "Джон Тьюки"
    }
  },
  "about": {
    "title": "О сайте",
    "goals": {
      "header": "Этот pet-проект был создан для выполнения следующих целей",
      "learn-d3": {
        "header": "Научиться манипулировать SVG с помощью D3.js",
        "description": "Существует множество библиотек позволяющих создавать SVG диаграммы, но D3 — самая известная из них. D3 может дать больше контроля над визуализациями, которые вы планируете создать, имеет большое сообщество и инфраструктуру."
      },
      "combine-d3-and-jsx": {
        "header": "Научиться комбинировать D3.js с JSX",
        "description": "По какой-то причине в большинстве руководств и примеров D3 используется синтаксис императивной цепочки. Но в настоящее время веб-разработчики тяготеют к использованию декларативного подхода (React, Vue). Оказывается, D3 можно использовать и декларативно. Поэтому одной из целей создания проекта было научиться сочетать два замечательных инструмента."
      },
      "compare-data": {
        "header": "Визуализировать и сопоставить интересные данные",
        "description": "Этот пункт не совсем подходит под понятие 'цель', как мне кажется. Я просто люблю сравнивать всякие штуки 😉"
      }
    },
    "technologies": "Стек технологий, используемых в процессе"
  },
  "youtube-channels": {
    "title": "Самые популярные YouTube каналы",
    "teaser": "Топ-50 крупнейших каналов по количеству подписчиков. Сравнение по языку, стране и категории контента.",
    "introduction": "В этой статье мы рассмотрим топ-50 YouTube каналов с самым большим количеством подписчиков по состоянию на 19 августа 2022 года.",
    "about-source": "Вся информация о каналах была взята из статьи: «List of most-subscribed YouTube channels», размещённой на Википидии.",
    "top-ten-channels": {
      "subheader": "Top 10 channels by amount of subscribers",
      "first-paragraph": "Как мы видим, первое место уверенно держит индийский музыкальный канал T-series. Количество подписчиков T-series более чем в 1,5 раза превышает количество подписчиков ближайшего преследователя.",
      "second-paragraph": "Интересно, что хотя в первой десятке есть представители 5 стран, языков, на которых они ведут свои каналы, всего два: английский и хинди."
    }
  },
  "james-bond-films": {
    "title": "Фильмы о Джеймсе Бонде",
    "teaser": "Сравнение всех фильмов про Агента 007 по потраченному бюджету и кассовым сборам. Давайте посмотрим на самого популярного актера, режиссера и самый успешный фильм."
  }
}